---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopError
source: html/48e109c1-c1ce-27cb-6c63-bf20a608b820.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopError Property

The column base can't be moved above its top.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnBaseAboveTopError { get; }
```